Revit 2027 API
BuiltInFailures.SystemNavigatorFailures Class
 Failures related with the system browser.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SystemNavigatorFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SystemNavigatorFailures
Public NotInheritable Class SystemNavigatorFailures
public ref class SystemNavigatorFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SystemNavigatorFailures = class end
The BuiltInFailures.SystemNavigatorFailures type exposes the following members.
Properties
Name | Description
CannottFindCorrectTreeNode |  Can't find the correct tree node in system browser according to the node index.
MultipleSelectNumberIsWrong |  The selected tree nodes number of system browser is wrong.
Top
See Also
Reference
Autodesk.Revit.DB Namespace